#include<stdio.h>
#include<windows.h>
/*标准 I/O 库并没有提供一种机制，在打印大整数时用逗号进行分割。编写一个程序，为人民币额的打印
提供这个功能，把一个数字（代表以分为单位的金额）转换为人民币格式，如下面的例子所示： 
表 8-1 输入和输出样例 
输入 输出 输入 输出 
0 ￥0.00 12345 ￥12.345 
1 ￥0.01 123456 ￥1,234.56 
12 ￥0.12 1234567 ￥12,345.67 
123 ￥1.23 12345678 ￥123,456.78 
1234 ￥12.34 123456789 ￥1,234,567.89 
 
要求：输入整数存入一个 long 型变量。 
编程提示：将整数从最低位开始按位依次取值存入一个字符数组，存入 2 位后，添加小数点,然后每 3 位添
加一个分号；小于 100 的正整数要做补 0 操作。 
如下表所示，存入的字符添加了小数点和分号，输出从字符数组最后一个字符倒序输出。 
表 8-2 字符数组和输出示例 
整数 字符数组 输出 
0 “00.0” ￥0.00 
1 “10.0” ￥0.01 
12 “21.0” ￥0.12 
123 “32.1” ￥1.23 
123456 “65.432,1” ￥1,234.56 
 
测试样例见上述表格 8-1。 
*/
int main()
{
    long long n =0;//输入
    char str[100] = {};//字符数组
    int flag = 0;//计数
    scanf("%lld",&n);
    while(1)
    {   
        if(n == 0)break;
        if(flag == 2)
        {
            str[flag] = '.';
            flag++;
        }else if(flag % 4 == 2 && flag != 2)
        {
            str[flag] = ',';
            flag++;
        }
        //12,345,678.90
        int temp = 0;
        temp = n % 10;//取末尾
        str[flag] = temp + '0';
        flag++;
        n /= 10;
    }
    if(flag < 4)
    {
        while(flag != 4)
        {
            if(flag == 2)
            {
                str[flag] = '.';
            }else
            {
                str[flag] = '0';
            }
            flag++;
        }
    }

    printf("￥");
    for(int i = flag - 1 ;i >= 0 ;i--)
    {
        printf("%c",str[i]);
    }
    Sleep(3000);
    return 0;
}
